[
  {
    "date": "July 4, 2021 8:36:13 am",
    "title": "Europe in vaccination race against COVID-19’s delta variant",
    "text": " vaccinations and outpace the spread of the more infectious , in a high-stakes race to prevent hospital wards from filling up again with patients fighting for their lives.The urgency coincides with Europe’s summer holidays, with fair weather bringing more social gatherings and governments reluctant to clamp down on them. ",
    "is_fake": 0
  },
  {
    "date": "July 4, 2021 8:46:49 am",
    "title": "Palestinian killed in West Bank clash, retaliatory Israeli strikes in Gaza",
    "text": "An Israeli military spokesperson said that soldiers had been trying to disperse confrontations that erupted between Israeli settlers and Palestinians from a nearby village in the West Bank.The troops then saw a man throw an explosive device at them from a rooftop and “responded with fire against the suspect in order to eliminate the danger,” the spokesperson said.The Palestinian liaison office confirmed that the 20-year-old man was killed.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  5:00:26 pm",
    "title": "UAE prohibits citizens from travelling to 14 countries, including India, Pakistan",
    "text": " .The UAE’s Ministry of Foreign Affairs and International Cooperation (MoFAIC) and the National Emergency Crisis and Disasters Management Authority (NCEMA) announced that its citizens are prohibited from travelling to India, Pakistan, Bangladesh, Nepal, Sri Lanka, Vietnam, Namibia, Zambia, the Democratic Republic of the Congo, Uganda, Sierra Leone, Liberia, South Africa, and Nigeria.",
    "is_fake": 0
  },
  {
    "date": "July 2, 2021 8:20:51 pm",
    "title": "Boeing 737 cargo plane makes emergency landing in water off Honolulu",
    "text": "“The pilots had reported engine trouble and were attempting to return to Honolulu when they were forced to land the aircraft in the water,” the US Federal Aviation Administration (FAA) said in a statement.Shares of Boeing fell 2 per cent.“According to preliminary information, the U.S. Coast Guard rescued both crew members.”",
    "is_fake": 0
  },
  {
    "date": "July 3, 2021 7:50:03 am",
    "title": "British PM Johnson says AstraZeneca’s India Covid shot should be accepted in travel schemes",
    "text": " vaccines should be left out of vaccine passport schemes after the European Union did not initially recognise it.About 5 million people in Britain are thought to have had the vaccine made by Serum Institute in India, known as Covishield.“I see no reason at all why the MHRA-approved vaccines should not be recognised as part of the vaccine passports and I’m very confident that that will not prove to be a problem,” Johnson said at a joint news conference with Angela Merkel, referring to Britain’s medicines regulator.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  3:19:45 pm",
    "title": "In the male world of whiskey, more women are calling the shots",
    "text": "The cold shoulder might have come because they were new to the scene, or because a portion of their whiskey was made outside Texas. But it didn’t help that all three of them — Marsha Milam, entrepreneur; Heather Greene, CEO and master blender; and Marlene Holmes, master distiller — were women, trying to make it in an industry well known for its assertive, sometimes aggressive masculinity.“There were literally complaints, like, ‘Why are they in here?’” Greene said.Undaunted, the Milam & Greene team persevered, winning competitions and critical acclaim, including an award at the Texas Whiskey Festival in April. And three years after that first, frosty reception, they find themselves not just accepted, but celebrated by other Texas distillers.",
    "is_fake": 0
  },
  {
    "date": "July 4, 2021 8:07:51 am",
    "title": "Major ransomware attack against US tech provider forces Swedish store closures",
    "text": "The shutdown of the major food retailer followed Friday’s unusually  The ransomware gang known as REvil is suspected of hijacking Kaseya’s desktop management tool VSA and pushing a malicious update that infect tech management providers serving thousands of business.Huntress Labs, one of the first to sound the alarm of the wave of infections at the providers’ clients, said Saturday that thousands of small companies might have been hit.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  2:58:55 pm",
    "title": "Japan could face vaccine crunch as it nears Olympics start",
    "text": "Osaka City — part of Japan’s second largest metropolitan area — will suspend reservations for first-time vaccinations on July 12 because of a lack of clarity on supply from the government, Mayor Ichiro Matsui said Friday in Tokyo after meeting Prime Minister Yoshihide Suga. The city of Chiba, just east of Tokyo, said it would suspend new appointments starting Friday, while a handful of other areas have stopped taking new reservations or pushed back plans to open access to people below the age of 65, according to Jiji Press.Japan’s vaccination drive has picked up speed after getting off to a slow start but will be nowhere reaching the bulk of the population before the country hosts the Olympics. Any slowdown in vaccinations puts pressure on Suga’s government as it tries hold the global sports spectacle during a  and tamp down on a worrying spike in infections in Tokyo ahead of the July 23 opening ceremony.",
    "is_fake": 0
  },
  {
    "date": "July 4, 2021 8:21:15 am",
    "title": "South Africa hits a new record with 26,000 daily Covid-19 cases",
    "text": " cases on Saturday, its second record-breaking tally in as many days, as a rampant third wave of infections coursed through a largely unvaccinated population.The rampant rise in infections in Africa’s most industrialised nation has stretched health services to breaking point, with hospitals out of beds and medics to man them, and forced the government to impose partial lockdown restrictions.South Africa has recorded over 2 million cases and 61,500 deaths so far during the ",
    "is_fake": 0
  },
  {
    "date": "July 3, 2021 8:06:00 am",
    "title": "Covid-19: Flexible, agile vaccination strategy vital in saving lives in India, says Lancet report",
    "text": "  continues to unfold, according to a latest Lancet report.The report ‘Responsive and Agile Vaccination Strategies Against COVID-19 in India’ published by the Lancet Global Health on Friday highlighted the importance of sentinel site based surveillance and detection of early warning signal through test positivity ratio (TPR).",
    "is_fake": 0
  },
  {
    "date": "July 2, 2021 10:53:41 pm",
    "title": "China building over 100 new silos for intercontinental ballistic missiles: Report",
    "text": "The silo construction project could provide China — which celebrated its 100th anniversary on Thursday at the Tiananmen Square — a means of concealing its nuclear weapons, The Washington Post reported on Thursday.The 119 nearly identical construction sites, that could potentially house powerful weapons capable of reaching the American mainland, are similar to those seen at existing launch facilities for China’s arsenal of nuclear-tipped ballistic missiles, the report said.It said that commercial satellite images obtained by researchers at the James Martin Center for Nonproliferation Studies in California show work underway at scores of sites across a grid covering hundreds of square miles of arid terrain in Gansu province, some 2,100 km from Beijing.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 1, 2021  5:00:56 pm",
    "title": "Explained: ‘Union’ or ‘central’ government? In Tamil Nadu, political tussle over words and their meaning",
    "text": "In common parlance, the terms “union government” and “central government” are used interchangeably in India. In Tamil Nadu, however, a controversy erupted earlier this month over the new DMK government referring to the government of Prime Minister Narendra Modi as the ‘union government’ () instead of ‘central government’ ().",
    "is_fake": 0
  },
  {
    "date": "Updated: July 1, 2021  7:32:26 am",
    "title": "Explained: Why The Associated Press will not name suspects in minor crimes",
    "text": "This, the AP said, was because stories have a long “afterlife” on the Internet, and the news agency is not able to follow up on each one of them to check if the initial charges brought by law enforcers were maintained, dropped, or reduced.The AP’s vice-president for standards, John Daniszewski clarified that the “policy of not identifying suspects by name applies to minor crime briefs” — the agency “will continue to identify suspects by name in stories on significant crimes, such as murder, that would merit ongoing news coverage”. In these cases, Daniszewski said, “naming a suspect may be important for public safety reasons”.As the AP pointed out, what happens if the suspect is eventually acquitted but reports about their involvement in crime can still be found on the Internet? How detrimental could this be to these individuals when they finally try to get on with their lives, maybe look for a job or other association with individuals or companies?",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  7:17:09 am",
    "title": "Explained: How the Covid-19 antibody test works, and how accurate it is",
    "text": " vaccine worked for me? Do I have antibodies to tackle  for a second time? These are some of the questions on peoples’ minds when they go ahead and book themselves an antibody test.As countries start re-opening, people are making sure they are 100% secure before stepping out into the new normal. As such, many have been seen falling back on antibody tests to ascertain their ",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  7:15:34 am",
    "title": "Explained: Why was July 1 chosen as the inauguration day for China’s Communist Party?",
    "text": "The CPC China website notes that the first CPC National Congress was attended by 12 delegates and was held between July 23-31 in 1921. At the time, the CPC had a total of 50 members, minuscule compared to the almost 90 million members of the party today.The venue of the first meeting was a house in Shanghai, but it was later moved to a boat on Lake Nanhu in Jiaxing County, Zhejiang Province, probably because of an impending police raid.“The central task of the congress was to discuss the question of officially establishing the Chinese Communist Party. The congress adopted the first Party program and decided on the name of the Party as the Communist Party of China,” the CPC website says.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  7:09:15 am",
    "title": "Explained: Facing up to the drone challenge",
    "text": " where suspected terrorists had used drones.Army Chief General M M Naravane emphasised this new threat on Thursday and said DIY (do it yourself) drones can be easily accessed and used by state and non-state actors, and India  to prevent such attacks.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  11:43:28 am",
    "title": "Explained: How ZyCov-D vaccine works, how it is different",
    "text": " vaccine.If approved by the regulator, ZyCov-D will be the  against infection with SARS-CoV-2.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  7:14:28 am",
    "title": "Explained: What is the ‘heat dome’ causing record temperatures in parts of North America?",
    "text": "On June 29, temperatures in Portland advanced to 46.7 degree Celsius. Referring to a map with heat spots, the National Weather Service (NWS) Portland tweeted, “That is not a lot of red and yellow dots in our area. This just shows how uncommon these temperatures are in our neck of the woods.” For three consecutive days, the city saw record temperatures. Before this, the highest temperatures were in August 1981 and July 1965.These temperatures being reported from the Pacific northwest and some parts of Canada are part of  that lasted over a week, a result of a phenomenon referred to as a “heat dome”. Several media reports note that people who are experiencing the heat wave are scrambling to buy air conditioners, some of them for the first time.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 2, 2021  11:46:48 am",
    "title": "Gold loans rising: should you pledge your holdings, or sell some of them?",
    "text": " has dented household earnings, especially in the middle and lower income categories. A rising cash crunch and unforeseen medical expenses seem to have prompted people to go for gold loans. Over the 12-month period ended May 2021, the gold loan segment for scheduled commercial banks recorded the highest credit growth among all sectors at 33.8%. While many people are looking to monetise their gold holdings to meet their immediate needs, the question is: When should you consider taking a gold loan?Over the last 12 months, gold loan outstanding with banks has risen from Rs 46,415 crore in May 2020 to Rs 62,101 crore. Since March 2020 when Covid struck, it has risen by 86.4%, or Rs 33,308 crore, RBI data shows. Industry insiders note this is only the business done by scheduled commercial banks.“If you include the loans extended by gold loan companies like Muthoot Finance and Manappuram Finance, the outstanding will be much higher. The gold loan segment has emerged as a major growth area for banks as it’s easier to get,” said an official of a nationalised bank. Public sector banks, which were not very keen on gold loans earlier, have found this a major growth area. State Bank of India has witnessed a 465% jump to Rs 20,987 crore in FY20-21.",
    "is_fake": 0
  },
  {
    "date": "July 2, 2021 9:48:07 am",
    "title": "The Trump Organization Indictment: Here’s what we know",
    "text": ", which marked a major turning point in the long-running investigation by the district attorney, Cyrus Vance, centered on the failure to pay taxes on a variety of valuable perks that Weisselberg and other executives received from the Trump Organization. Here is what we know:The indictment accused the Trump Organization and Weisselberg of engaging in a 15-year scheme starting in 2005 to help executives evade taxes by compensating them with perks and bonuses that were kept off the books. The company also dodged some taxes it would have owed, the indictment said.The indictment called Weisselberg one of the largest beneficiaries of the scheme, and said that he received about $1.76 million in indirect and hidden compensation, allowing him to evade hundreds of thousands of dollars in taxes at every level of government. It said that he had improperly received a total of $133,000 in federal and state tax refunds as well.",
    "is_fake": 0
  },
  {
    "date": "July 2, 2021 11:10:29 am",
    "title": "Explained: Bill Cosby’s release from prison",
    "text": " this week after three years in prison when the Pennsylvania Supreme Court  his 2018 convictions on charges of drugging and sexually assaulting Andrea Constand in 2004, when she was a Temple University employee.The abrupt reversal of the first high-profile sexual assault conviction after the #MeToo movement has attracted particular interest, raising questions such as whether Cosby could still face prosecution over any of the accusations of sexual assault and misconduct that more than 50 women have leveled against him.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 1, 2021  11:04:45 am",
    "title": "CureVac Covid-19 vaccine records only 48% efficacy in final trial readout",
    "text": " vaccine was 48% effective in the final analysis of its pivotal mass trial, only marginally better than the 47% reported after an initial read-out two weeks ago.The German biotech firm said that efficacy, measured by preventing symptomatic disease, was slightly better at 53% when excluding trial participants older than 60 years, an age group that is by far the most severely affected.CureVac said on June 16 its COVID-19 vaccine, known as CVnCoV, proved only 47% effective in an initial trial read-out and that new variants had proved a headwind, denting investor confidence in its ability to take on rival shots.That wiped billions of euros from its market value.",
    "is_fake": 0
  },
  {
    "date": "July 1, 2021 11:23:21 am",
    "title": "Angela Merkel to discuss travel restrictions with British PM, meet Queen",
    "text": "The German leader is visiting the UK for talks with British Prime Minister Boris Johnson at his Chequers official country residence on the same day. The two will discuss German travel restrictions.The 95-year-old monarch will host Merkel at Windsor Castle. As Merkel is stepping down following Germany’s September elections, it is expected to be her final meeting with the queen.German government spokesperson Steffen Seibert called the royal invitation “an honor that the chancellor is very excited about.”",
    "is_fake": 0
  },
  {
    "date": "Updated: June 29, 2021  8:07:38 am",
    "title": "Explained: A controversy in Brazil over buying vaccines from Bharat Biotech",
    "text": " vaccine  for 1.6 billion reais (around Rs 2,400 crore) is roiling Brazil’s rightwing President Jair Bolsonaro, who came to power in 2019 after running on an anti-graft agenda.On Friday, two sensational testimonies by whistleblowers before a parliamentary panel blamed the President and his powerful coalition chief for agreeing to buy the Indian vaccine at a price that was allegedly higher than that of other options available in the market — that too, when it lacked local regulatory approval.",
    "is_fake": 0
  },
  {
    "date": "Updated: July 1, 2021  9:21:13 am",
    "title": "Explained: How worrying is the Delta Plus variant of Covid-19?",
    "text": " variant, a mutated version of the  of the SARS-CoV2 . While the transmissibility of Delta Plus is being monitored and lab tests are underway to check vaccine effectiveness, experts have said Delta Plus does not appear to be more infectious than Delta.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 29, 2021  7:20:05 am",
    "title": "Explained: Does Olympic champ Roehler’s withdrawal improve Neeraj Chopra’s medal prospects at Tokyo?",
    "text": "Estonia’s Magnus Kirt, the silver medallist from the 2019 World Championships in Doha, had pulled out of the Olympics a fortnight ago because of a leg injury.Does the absence of two of the top throwers brighten India’s Neeraj Chopra’s chances for winning an elusive track and field medal?In his first competition in over a year, Chopra improved the national record by a centimetre to 88.07 metres at the Indian Grand Prix 3 in Patiala in early March.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  7:08:27 am",
    "title": "PSU directors: This is what Gujarat HC said when UPA packed names",
    "text": "Dismissing the concern, the court stated: “Primary consideration of the Government should be the interest of public sector banks, its depositors and not interest of the nominees or any other vested interest. We are sure that the Government will give serious thought in future so unnecessary criticism could be avoided.”The petition was based on an investigation by  in May 2007 that the then Government headed by ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 29, 2021  8:30:28 am",
    "title": "Explained: Why is Haryana scanning 16.65 crore revenue documents, how it will help landowners",
    "text": " explains the objective of the initiative and its possible benefits to the landowners and authorities.Chief Minister Manohar Lal Khattar has approved an ambitious project of Rs 77 crore to digitise the record rooms of revenue offices across the state. From this sanctioned amount, Rs 44 crore will be spent to set up modern revenue record rooms at the district level.Haryana Additional Chief Secretary (revenue) Sanjeev Kaushal says these record rooms will be ready in next two months.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 29, 2021  8:11:27 am",
    "title": "Explained: America’s fascination with UFOs, and what a govt report has found",
    "text": "The report, which is largely inconclusive, looks at instances of apparent UFO sightings noticed between November 2004 and March 2021. While there is no evidence that the sightings were UFOs, there is no other explanation either for what these sightings were. Recently, former US President  said on James Corden’s The Late Late Show that there is evidence of objects in the sky “we don’t know exactly what they are.”The concept of “flying saucers” has captured the American imagination since the 1940s and 1950s. This has been connected to their ideas about life on the Moon, canals on the Red planet and Martian civilisations, notes an article published by the Library of Congress.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 29, 2021  12:50:38 pm",
    "title": "New research: Chinese vaccine CoronaVac found safe, effective in kids, adolescents",
    "text": "The randomised controlled trial covered 550 young people. More than 96% of children and adolescents who received two doses of the vaccine, manufactured by Sinovac, developed antibodies against SARS-CoV-2.Most adverse reactions were mild or moderate, with pain at the injection site the most commonly reported symptom.The authors conducted a randomised, double-blind, controlled phase 1/2 clinical trial between October and December 2020. The vaccine or a control was given by intramuscular injection in two doses (1.5 or 3 micrograms).",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  10:19:25 pm",
    "title": "No payment received from Brazil govt, ‘step-by-step’ approach followed: Bharat Biotech over Covaxin deal row",
    "text": " Covid vaccine, the pharmaceutical company has clarified that it had not received any payment from the Government of Brazil so far.“As of 29th June 2021, Bharat Biotech has not received any advance payments nor supplied any vaccines to Ministry of Health Brazil,” the company statement reads.Regarding the pricing of the doses, the company said, “The pricing of Covaxin has been clearly established between $15-20 per dose for supplies to governments outside India. The pricing for Brazil has also been indicated at $15 per dose,” news agency PTI reported.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  7:57:39 am",
    "title": "Explained: Why a US court has dismissed FTC lawsuit against Facebook",
    "text": " that sought to undo the company’s acquisitions of Instagram and WhatsApp. This is being seen as a major blow to the US administration’s antitrust efforts against big-tech companies.In December last year, an antitrust lawsuit was filed against Facebook alleging that has harmed competition by buying up smaller companies like Instagram and WhatsApp to squash the threat they posed to its business. While the suit was filed by the New York attorney general, 47 other state and regional attorneys general joined it. The overarching theme of the lawsuit was that Facebook, which acquired Instagram for $1 billion in 2012 and WhatsApp for $19 billion in 2014, violated antitrust laws by purchasing companies that were potentially on their way to becoming competitors to Facebook in the social media market.According to a Reuters report, the US judge said the federal complaints were “legally insufficient”. Judge James Boasberg said the FTC failed to show that Facebook had monopoly power in the social-networking market but said the FTC could file a new complaint by July 29, the report said. He also dismissed a lawsuit by multiple US states saying they waited too long to challenge the acquisitions of Instagram and WhatsApp in 2012 and 2014 respectively.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  9:54:37 am",
    "title": "History of the CPC and its leaders — and President Xi’s ambitious new long march for China",
    "text": ") that gives an individual the right to rule. While a capable ruler would be allowed to govern with a renewed mandate, it could be revoked in the case of a despot. Interestingly, a dynastic bloodline was never the criterion to determine the line of succession.Since the time the seeds of Chinese civilisation sprouted on the flood plains of the Yellow River () almost five millenniums ago, hundreds of rulers have taken the legendary title of the ‘Yellow Emperor’ (",
    "is_fake": 0
  },
  {
    "date": "July 1, 2021 9:04:03 am",
    "title": "Mexico’s Covid-19 death toll could be 60% higher than official count",
    "text": "Authorities have said previously that fatalities likely far exceed the official count, and the latest figure is in line with data published in March.Mexico registered 351,376 excess deaths associated with COVID-19 from the start of the  through the 20th week of this year, which would be May 23, latest data shows.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  11:58:41 am",
    "title": "Explained: The terms for loaning out Bose artefacts at Red Fort; when they will be brought back",
    "text": "-related lockdowns.Soon after, the Ministry of Culture and the Archaeological Survey of India (ASI), custodians of the Red Fort, had to  that the cap (and other artefacts) had not gone missing from the Red Fort; they were, in fact, loaned out to the Victoria Memorial Hall (VMH) in Kolkata for an exhibition on the freedom fighter.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  7:55:31 am",
    "title": "Explained: What is EU’s new ‘vaccine passport’ programme, and why has Covishield not been included?",
    "text": "The EU Digital Covid Certificate, or the “green pass” as it is popularly known, has been created to restore freedom of travel for the public and remove the barriers on entry placed due to the .With the new vaccine passport system coming into effect across EU from July 1, the absence of Covishield from the list of EMA-approved vaccines can be of particular concern for Indians who hope to travel to European countries soon.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:40:38 am",
    "title": "Explained: Before BJP MPs’ remarks, the statehood movements from North Bengal",
    "text": " MPs from West Bengal recently called for separate states to be carved out in Jangalmahal and North Bengal respectively. While these are individual statements, which the BJP leadership has distanced itself, West Bengal has also seen three full-fledged movements for separate states since Independence — all from parts of North Bengal.A look at the two BJP leaders’ remarks and the three statehood movements:On June 13, BJP MP from Alipurduar John Barla demanded a separate state or a Union Territory in North Bengal, saying the region has lacked development over the years. On June 21, BJP MP from Bishnupur Saumitra Khan demanded that Jangalmahal region (formerly a Maoist belt, not in North Bengal) be made a separate state, contending there have never been serious development there.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 26, 2021  8:25:55 am",
    "title": "Explained: What is Japan’s four-day work week proposal?",
    "text": "instead of the current five-day work week. These guidelines were finalised last week by Japan’s prime minister Yoshihide Suga and aim to bring about work-life balance, especially for people who have to take care of their families or want to learn new skills.The Mainichi reported that the policy has been implemented keeping in mind the labour shortage in the country. The idea is to improve employees’ productivity, but some employers are skeptical if productivity will be boosted enough to compensate for the lost work day, Mainichi reported. On the other hand, employees are fearing a pay cut since they will be working one day less.“Among expected advantages are helping people with family-care responsibilities avoid the need to quit their jobs, promotion of recurrent education, and helping more people take on side jobs,” the report said.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 26, 2021  12:54:01 pm",
    "title": "Registered valuer: The mandate to carry out valuation of an entity",
    "text": " surrounding a Rs 4,000 crore share allotment decision by PNB Housing Finance to investors led by Carlyle at a price of Rs 390 per share. While the matter has reached the Securities Appellate Tribunal, the Securities and Exchange Board of India (SEBI) had on June 18 written to PNB Housing stating that the latter’s board resolution with regard to the “issue of securities of the company”, in its EGM notice dated May 31, is “ultra-vires” of the company’s Articles of Association (AoA) and should not be acted upon until the company undertakes a valuation of shares, as prescribed in its AoA, by an independent registered valuer.A registered valuer is an individual or entity which is registered with the Insolvency and Bankruptcy Board of India (IBIBI) as a valuer in accordance with the Companies (Registered Valuers and Valuation) Rules, 2017. Under Section 458 of the Companies Act, IBBI has been specified as the authority by the central government.The concept of registered valuer was introduced in the Companies Act in 2017 in order to regulate the valuation of assets and liabilities linked to a company and to standardise the valuation procedure in line with global valuation standards.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:40:48 am",
    "title": "Explained: How shutting parks in the rainy season helps tigers",
    "text": "Until now, Rajaji’s Jhilmil and Corbett’s Jhrirna zones remained open round the year, while the latter’s Bijrani zone closed for four months from June 15 to October 15. The rest of Corbett and Rajaji usually remained shut for tourism between June 15 and November 15.The dates vary due to variation in forest quality, topography and climate. For example, the peripheral forests of Jhirna remain open throughout. Bijrani is not as affected by seasonal streams as the northern parts, say Dhikala, of Corbett and opens a month early.In comparison, meagre rainfall in Rajasthan allows Ranthambhore National Park to stay open for 9 months between October and June. And high monsoon in Assam forces Kaziranga National Park to stay practically shut for six months between May and October.",
    "is_fake": 0
  },
  {
    "date": "June 26, 2021 8:20:51 am",
    "title": "Explained: What’s the story behind the 751 unmarked graves found in Canada?",
    "text": " on the grounds of another former residential school in British Columbia.Canadian Prime Minster Justin Trudeau said he was “terribly saddened” by the new discovery, adding that it was a “shameful reminder of the systemic racism, discrimination and injustice that indigenous peoples have faced — and continue to face — in this country.” Several protests erupted across Canada after the 215 graves were found, culminating in the toppling of a statue of Egerton Ryerson, one of the key figures behind Canada’s residential school system.The unmarked graves add to the plethora of data showing the atrocities committed against indigenous children by the Canadian residential school system and the callousness with which the Canadian government treated the matter of their deaths.",
    "is_fake": 0
  },
  {
    "date": "June 26, 2021 9:38:55 am",
    "title": "Explained: What to expect next over Haryana DGP’s plea seeking repatriation to IB",
    "text": "Manoj Yadava has approximately four years of service left. In his letter addressed to Additional Chief Secretary (Home) Rajeev Arora, Yadava wrote that the government of Haryana had extended his tenure as DGP, Haryana “beyond 20.01.2021 till further orders”.He added: “The Ministry of Home Affairs, Govt of India, vide its order dated March 2, 2021 had also conveyed the approval for extension of my deputation tenure for a period of one year beyond 20.02.2021 or till further orders whichever is earlier. In this connection, it is informed that the undersigned would now like to return to Intelligence Bureau, Ministry of Home Affairs, Government of India, to resume duties as Additional Director in the Intelligence Bureau due to career consideration and family requirements. It is, therefore, requested that the undersigned may kindly be relieved for re-joining the Intelligence Bureau.”As per the rules of business governing the establishment of IAS/IPS officers, the final word lies with the CM of the state. Since Yadava has put in a request seeking repatriation, it shall be forwarded to Home Minister Anil Vij and CM Manohar Lal Khattar. Even if Vij accepts Yadava’s request, Khattar can always accept or overrule home minister’s viewpoint and reject it.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:21:44 am",
    "title": "Explained: What led to Sydney’s ‘scariest period’ since the pandemic started?",
    "text": ", Australia’s most populous state, New South Wales (NSW), is experiencing what the state’s Premier Gladys Berejiklian described as  since the  first started. The culprit behind the latest outbreak is the highly-contagious ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:38:02 am",
    "title": "Explained: What is the Common Entrance Test Maharashtra has announced for Class XI admissions?",
    "text": " an optional Common Entrance Test (CET) for admissions to Class XI to ensure uniformity and to give equal opportunity to all students.Until last year, admissions to first year junior college (FYJC) took place based on Class X marks except in six areas — Mumbai Metropolitan Region, Pune and Pimpri Chinchwad municipal corporation, municipal corporation areas of Nagpur, Nashik, Aurangabad and Amravati — where a centralised online admission process was conducted based on Class X merit and student’s college preference.The Maharashtra school education department will hold the CET for admissions to FYJC seats during the last week of July or first week of August. It will be held offline and students need to go to designated exam centres to appear for the test. It will be a 100 marks multiple choice question format exam and its duration would be two hours. It will be an objective, multiple-choice exam based on the Class X, SSC syllabus. The Optical Mark Recognition (OMR) based question paper will have questions from four subjects i.e. English, Mathematics, Science, Social Sciences subjects, with each subject carrying 25 per cent weightage of marks. A six-member committee has been formed under the chairmanship of Maharashtra education commissioner Vishal Solanki to finalise the dates and further details of the entrance exam.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:30:15 am",
    "title": "Explained: The story of how North Korea hackers stole $81 million from Bangladesh Bank",
    "text": "The BBC investigation says that the attack happened between February 4-7, 2016. The timing was carefully planned to take advantage of the time difference between Dhaka and New York City, and working hours in both cities, with also a weekend on different days falling on the date of the heist.The hackers, whom American investigative agencies believe are linked to North Korea, used fraudulent orders on the SWIFT payments system to steal US$951 million, which was almost all the money in that account, from Bangladesh’s central bank account. The hackers used a Federal Reserve Bank account in New York and successfully managed to steal $81 million that was transferred to accounts at Manila-based Rizal Commercial Banking Corporation.The BBC reports points to an ordinary office printer located inside a “highly secure room on the 10th floor of the bank’s main office in Dhaka” that was reportedly malfunctioning. This printer was specifically used to print transaction records of the bank worth millions of dollars. On February 5, 2016, bank staff found that the printer wasn’t working but had assumed it was a technical glitch, one that occurred fairly often.",
    "is_fake": 0
  },
  {
    "date": "June 26, 2021 2:46:57 pm",
    "title": "Explained: How Small and Medium Companies will benefit from higher thresholds",
    "text": " examines the exemptions and the impact of the change in the definition of SMC.The Corporate Affairs Ministry has increased the turnover threshold for SMCs to Rs 250 crore from Rs 50 crore, and the borrowing threshold to Rs 50 crore from Rs 10 crore. SMCs are permitted to avail a number of exemptions under the Company (Accounting Standards) Rules 2021 to reduce the complexity of regulatory filings for smaller firms.Banks, financial institutions, insurance companies and listed companies cannot be classified as SMCs.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:06:38 am",
    "title": "Explained: What are the tax, compliance reliefs announced for Covid-related assistance?",
    "text": " , the government on Friday  for financial assistance received by people from employers and others for treatment of Covid-19.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:44:03 am",
    "title": "Explained: What are the sacrilege incidents that have Punjab on edge?",
    "text": " as well as the police firing on those protesting the same in 2015 when the SAD- combine was in power.After the ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  1:42:35 pm",
    "title": "Explained: Do India falter in knockout matches of ICC tournaments?",
    "text": " (WTC) by beating India at Southampton. India, on the other hand, bottled another International Cricket Council (ICC)-organised global tournament — six on the spin now starting from the 2014 World T20.New Zealand won the WTC final deep into the final session on the reserve day after two days of play were washed out due to rain. The backstory is that in 2014, India lost the ICC World T20 final to Sri Lanka. A year later, they lost the World Cup (50 overs) semifinal to Australia in Sydney. In 2016, they went down to the West Indies in the ICC World T20 semifinal in Mumbai. In 2017, India lost the Champions Trophy final to Pakistan at The Oval, while in 2019, New Zealand got the better of them in the World Cup semifinal at Old Trafford.Swing and seam proved to be India’s bugbear in the WTC final. In the first innings, Kyle Jamieson was the destroyer-in-chief with 5/31. In the second, he dismissed ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  7:32:29 am",
    "title": "Explained: Why former Haryana CM Om Prakash Chautala may be a free man soon",
    "text": "Chautala, who has been serving his sentence after being convicted of corruption in the infamous Junior Basic Training (JBT) teachers’ recruitment scam, has been out of jail on parole for the past several months.Under what law has he been granted the benefit of early release, and what does his likely re-entry into active politics mean for the political situation in Haryana?Chautala became Chief Minister four times, serving three short terms from December 2, 1989 to May 22, 1990 (",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  12:09:56 pm",
    "title": "New research: Low-cost method for finding new variants of coronavirus",
    "text": "Since the onset of the , thousands of viral genomes have been sequenced to reconstruct the evolution and global spread of the . This is important for identifying particularly concerning variants that are more contagious, pathogenic, or resistant to the existing vaccines.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:40:29 am",
    "title": "Uttarakhand’s unelected Chief Minister: the crisis, the law, and BJP’s options",
    "text": " to get elected to the Legislative Assembly. Rawat, sworn in on March 10 as a surprise pick of the  state legislature party, has until September 10 to get elected as an MLA in a bypoll. But with the  raging, uncertainty prevails over whether a bypoll can be held within that time-frame, and over the legal and political implications if it is not held.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  7:05:33 am",
    "title": "Experts Explain: Hurdles in class action",
    "text": "For over 35 years, India’s laws for negligence and liability have not been strengthened, in order to force safety and prevention measures, and to minimise such incidents.In the ONGC matter, there is little the families can do in terms of personal injury suits, or class action suits. Both these legal options are weak in India, and not considered a worthwhile exercise.However, they are necessary if India is to improve its ease of doing business rankings, especially in disaster prevention and risk of life.",
    "is_fake": 0
  },
  {
    "date": "June 24, 2021 8:41:25 am",
    "title": "Explained: What is ranked choice voting, which made its debut in New York mayoral polls?",
    "text": "Rather than pick just one candidate, voters get to rank several in order of preference. Even if a voter’s top choice doesn’t have enough support to win, their rankings of other candidates still play a role in determining the victor.But the system is more complex than a traditional election, making it tough to forecast a winner. It could take longer to get results.In New York City’s version, voters get to rank up to five candidates, from first to last, on their ballot.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  1:09:42 pm",
    "title": "Explained: How press freedom is being eroded in Hong Kong",
    "text": "The growing pressure on the media was underscored on Wednesday when  Daily, a pro-democracy tabloid that is often critical of the Chinese and Hong Kong governments, said it had no choice but to close. The newspaper, which had been one of the most widely read in Hong Kong, is the subject of a national security investigation that has also imprisoned its founder, Jimmy Lai.Despite having the right to free speech enshrined in its local constitution, the Chinese territory is now ranked 80th out of 180 countries and regions on the World Press Freedom Index, down from 18th when Reporters Without Borders first published the index in 2002.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:29:43 am",
    "title": "The story of John McAfee, for long synonymous with anti-virus software, and his extraordinary life",
    "text": " on Wednesday (June 23), authorities claimed. The 75-year-old was found dead hours after a Spanish court approved his extradition to the United States to face charges of tax evasion between 2014 and 2018.The computer programmer rose to fame in the 1980s when he founded McAfee Associates, a software company that made its name by selling commercial computer security software.McAfee resigned from the company in 1994, and the company was bought by ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  1:00:13 pm",
    "title": "Explained: What is the Single National Curriculum proposed for schools in Pakistan and what are its criticisms?",
    "text": " and his party, the Pakistan Tehreek e-Insaf (PTI), promised a series of educational reforms that would improve outcomes across Pakistani schools and bridge the gap between private and public educational institutions.As part of this policy, his government proposed implementing a Single National Curriculum (SNC) that would establish a uniform system “in terms of curriculum, medium of instruction and a common platform of assessment so that all children have a fair and equal opportunity to receive high-quality education”. Like the previous National Curriculum in 2006, the current SNC will only provide the minimum learning standards that every child should be able to achieve in a particular subject at a certain grade level. The first phase of the SNC was launched in March 2021 and covers primary school students. The second and third phases covering classes 6 to 12 will be rolled out by 2023.Since its proposal, the SNC has come under significant criticism for its focus on religious topics, its impact on state’s autonomy and its efficacy in improving educational standards.",
    "is_fake": 0
  },
  {
    "date": "June 24, 2021 3:06:28 pm",
    "title": "Explained: Creditors choose Suraksha for Jaypee resolution; what happens now?",
    "text": "Suraksha ARC’s resolution plan reportedly received the support of 98.66 per cent of the financial creditors while NBCC’s resolution plan received approval from 98.54 per cent of financial creditors.What is the background of this decision by the Committee of Creditors, and what are its implications?Jaypee Infratech has total debt obligations of over Rs 22,000 crore, including 20,000 homes that the company has failed to deliver to buyers for over a decade.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 25, 2021  9:46:13 am",
    "title": "Explained: Who was Ziona Chana, the patriarch of the ‘world’s largest family’?",
    "text": ", a flurry of headlines followed. For years, Ziona’s incredible story — featuring his 38 wives, 89 children and 36 grandchildren — has fascinated the world, drawing tourists and journalists to his four-storey purple home in a Mizoram village. However, beyond his polygamous nature, little is known of Ziona, or the religious sect he led. Who was Ziona Chana, how did his sect come into being, how do its members live and who takes over after his death?“Chhuanthar” (New Generation), as Ziona’s cult is called, first made headlines when HC Vanlalruata, a local Mizo journalist, stumbled upon his story sometime in 2010.In the years that followed, the 100-roomed “Chhuanthar Run” (New Generation House) where Ziona and his family lived, became a tourist spot, and is even listed as a ‘place of interest’ in the state’s official tourism website.",
    "is_fake": 0
  },
  {
    "date": "June 24, 2021 3:38:23 pm",
    "title": "Explained: India’s first maritime arbitration centre, coming up in Gandhinagar",
    "text": "This will be the first centre of its kind in the country that will manage arbitration and mediation proceedings with disputes related to the maritime and shipping sector.The GIMAC will be part of a maritime cluster that the Gujarat Maritime Board (GMB) is setting up in GIFT City at Gandhinagar. The Maritime Board has rented about 10,000 square feet at GIFT House which is part of the Special Economic Zone (SEZ) area with the clearance from the development commissioner.The centre is expected to be ready by the end of August.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  7:34:33 am",
    "title": "Once Captain’s man, Kejriwal’s new ‘officer bhai’ loves spotlight, ‘not free from blemish’",
    "text": " on Monday, Delhi Chief Minister and party convenor welcomed him as “my officer  (My officer brother)”.Kejriwal, party leaders said, visited Amritsar Monday with the main objective of inducting the former IPS officer. ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  11:20:36 am",
    "title": "Explained: Should Covid positive mothers stay away from their newborns?",
    "text": " as well as other infections.  explains why newborns and their mothers should not be separated even during the .",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  7:21:24 am",
    "title": "Trends in use of social media in India since 2014: growth across platforms, user profile",
    "text": "In its 2019 National Election Study, Lokniti asked voting-age citizens about the frequency with which they used five SM platforms — , Twitter, WhatsApp, Instagram and YouTube. WhatsApp, which launched in 2009 and has taken the government to court recently complaining that the new digital rules violate its privacy protections, emerged the most popular with 34% using it (regular and rare users combined) (Table 1).Next was Facebook, in existence in India since 2006, which is used by 32%, followed closely by YouTube that started in 2005, at 31%. Instagram, which arrived on the scene in 2010, was used by 15% adults, and Twitter, operating since 2006, was the least popular with 12% users. It’s difficult to say why Twitter has been a low performer, but a possible reason could be its more textual, less visual nature. It is to be seen how much its latest audio chat room feature helps it grow.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  2:02:29 pm",
    "title": "Explained: What govt proposes to change in film certification",
    "text": " to the general public for comments until July 2. The new draft proposes to amend the Cinematograph Act of 1952 with provisions that will give the Centre “revisionary powers” and enable it to “re-examine” films already cleared by the Central Board of Film Certification (CBFC).A look at what the draft proposes to change:The Ministry of Information and Broadcasting proposes to add a provision to the Act that will equip the Centre with revisionary powers on account of violation of Section 5B(1) (principles for guidance in certifying films). The current Act, in Section 6, already equips the Centre to call for records of proceedings in relation of a film’s certification. The Ministry explained that the proposed revision “means that the Central Government, if the situation so warranted, has the power to reverse the decision of the Board”.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  2:04:48 pm",
    "title": "Delimitation in Jammu and Kashmir: how, why",
    "text": " from Jammu and Kashmir for a meeting with the Prime Minister in the national capital this week has led to speculation about possible scheduling of the Assembly elections. On Independence Day last year, Prime Minister Narendra Modi had said elections would be held in J&K after the delimitation process in the Union Territory was over. Delimitation is crucial for kick-starting the political process in J&K.Delimitation is the act of redrawing boundaries of an Assembly or Lok Sabha seat to represent changes in population over time. This exercise is carried out by a Delimitation Commission, whose orders have the force of law and cannot be questioned before any court. The objective is to redraw boundaries (based on the data of the last Census) in a way so that the population of all seats, as far as practicable, be the same throughout the State. Aside from changing the limits of a constituency, the process may result in change in the number of seats in a state.Delimitation exercises in J&K in the past have been slightly different from those in the rest of the country because of the region’s special status — which was scrapped by the Centre in August 2019. Until then, delimitation of Lok Sabha seats in J&K was governed by the Constitution of India, but the delimitation of the state’s Assembly seats was governed by the Jammu and Kashmir Constitution and Jammu and Kashmir Representation of the People Act, 1957.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:32:14 am",
    "title": "Explained: In bats in Mahabaleshwar cave, antibodies against Nipah virus",
    "text": " (NiV) in bats of India has picked up samples with the presence of antibodies against the Nipah virus in some bat species from a cave in Mahabaleshwar, a popular hill station in Satara district, Maharashtra.NiV is on the top-10 priority list pathogens identified by the World Health Organization.Till date, India has experienced four episodes of NiV outbreaks with CFR ranging from 65% to 100%. The first evidence of NiV infection was reported in Siliguri district, West Bengal in 2001, followed by Nadia district in West Bengal in 2007. The presence of NiV antibodies were detected in Mynaguri and Dubri district of Assam and Cooch Behar of West Bengal, both places situated close to Bangladesh border . A third outbreak occurred in Kozhikode district of Kerala state in 2018 with 18 case fatalities, followed by another outbreak in the same state in 2019 . A study in 2018 has identified many South East Asian countries including Indian states as potential hotspots for the NiV disease.",
    "is_fake": 0
  },
  {
    "date": "June 22, 2021 9:56:39 am",
    "title": "Explained: Why do France’s regional elections matter?",
    "text": "The next presidential vote is less than a year away. Polls show that contest is most likely to result in a repeat of the 2017 duel between Macron and far-right leader Le Pen – only this time the gap between the two will be narrower.The regional results do not give a representative snapshot of who will win the presidential vote. However, if the far-right were to secure its first ever regional powerbase it would send tremors across the political landscape.Macron’s ruling La Republique en Marche (LaRem) will not win any region outright, revealing the extent to which it has failed to plant roots locally.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  2:38:41 pm",
    "title": "Explained: The draft rules for e-commerce companies, and how it will impact online shoppers",
    "text": " to the e-commerce rules under the Consumer Protection Act to make the framework under which firms operate more stringent. While a number of new provisions are similar to what the Centre sought of social media companies through the  announced earlier this year, several proposals in the e-commerce rules are aimed at increasing liabilities for online retailers for goods and services purchased on their platforms.Firstly, the draft rules issued by the Consumer Affairs Ministry seek to ban “specific flash sales” by e-commerce entities. While as per the draft rules, conventional e-commerce flash sales are not banned, specific flash sales or back-to-back sales “which limit customer choice, increase prices and prevents a level playing field are not allowed”.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 22, 2021  8:07:25 am",
    "title": "Explained: Will Laurel Hubbard be the first of several transgender competitors to qualify for women’s events in Tokyo?",
    "text": " selected for the Olympics. Hubbard, 43, had participated in the men’s category as Gavin before coming out in 2013. She will compete in the women’s 87-kilogram class in Tokyo.The International Olympic Committee’s guidelines on transgender athletes allow those like Hubbard, who have made the transition from male to female, to compete if certain conditions are fulfilled.Such athletes, to be eligible to compete in the women’s category, must keep their testosterone levels in the serum to below 10 nanomoles per litre for the preceding 12 months before a competition. The athlete will be monitored regularly and non-compliance could result in ineligibility.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:28:19 am",
    "title": "Explained: What were the mysterious lights and boom in Gujarat night skies?",
    "text": "In Upleta town in Rajkot district, people heard a loud boom, followed by burning objects appearing to fall from the sky but blazing out before they could hit the ground.“I was leaving a shop in Kutubkhana when I heard a loud sound, like some kind of explosion. When I looked around, I saw ablaze objects falling down, but burning out in the air,” Laxman Bhopala, 48, a farmer who lives on Yadav Road in Upleta, told . He was among those who took videos of the incident on his phone.",
    "is_fake": 0
  },
  {
    "date": "June 22, 2021 3:06:17 pm",
    "title": "Explained: Why can’t Delhiites have their liquor home-delivered yet?",
    "text": "Among all the changes, a seemingly minor tweak in a clause relating to home delivery of alcohol drew a lot of attention, especially at a time when queuing up outside liquor stores is a proposition fraught with risks of catching the  virus.The amendment was notified on June 1, and it came into effect on June 11. It brought Delhi one step closer to the home delivery of liquor.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 23, 2021  7:38:36 am",
    "title": "Compensation for Covid deaths: petition in Supreme Court, and what the law says",
    "text": " or related complications. The Centre had submitted by affidavit on Saturday that state governments , and had argued in favour of a broader approach including health interventions.Last year, the Centre declared Covid-19 as a notified disaster under the Disaster Management Act.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 23, 2021  1:59:58 pm",
    "title": "Explained: How judges recuse from cases, and why",
    "text": " from hearing cases relating to West Bengal. On June 21, Delhi High Court judge Anup Bhambhani recused himself from hearing a plea by digital media houses challenging the validity of the IT rules regulating intermediaries.When there is a conflict of interest, a judge can withdraw from hearing a case to prevent creating a perception that she carried a bias while deciding the case. The conflict of interest can be in many ways — from holding shares in a company that is a litigant to having a prior or personal association with a party involved in the case.The practice stems from the cardinal principle of due process of law that nobody can be a judge in her own case. Any interest or conflict of interest would be a ground to withdraw from a case since a judge has a duty to act fair. Another instance for recusal is when an appeal is filed in the Supreme Court against a judgement of a High Court that may have been delivered by the SC judge when she was in the HC.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 18, 2021  12:21:27 pm",
    "title": "New research: Exposure to common cold virus can help fight Covid-19",
    "text": ", researchers have found.In a new study, published in the the Journal of Experimental Medicine, researchers from Yale University found that the common respiratory virus jump-starts the activity of interferon-stimulated genes. These are molecules in the immune system whose early response can halt replication of the SARS-CoV-2 virus within airway tissues infected with the cold.Triggering these defences early in the course of Covid-19 infection holds promise to prevent or treat the infection, the Yale University website quotes said the study’s senior author, Ellen Foxman, as saying. One way to trigger these defences is by treating patients with interferons, an immune system protein which is also available as a drug. “But it all depends upon the timing,” Foxman is quoted as saying.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  8:58:14 am",
    "title": "Explained: Federal Reserve signals, and Indian markets",
    "text": ". In India, the benchmark Sensex fell marginally and the rupee lost over 1% against the dollar on Thursday. If the Fed changed its position in line with the progress in economic recovery and the inflation situation in the US, in India too there have been growing concerns on inflation.The wholesale price index-based (WPI) inflation scaled a record high of 12.94% in May, pushed by higher fuel and commodity prices, and a low base effect. It also translated into retail inflation of 6.30% in May — a six-month high that breached the inflation target of 4 ± 2% set by the Reserve Bank of India. While it remains to be seen how the RBI responds, market participants feel that if inflation comes alongside a rebound in the economy, it should not be a big concern for investors.While maintaining they would continue with an accommodative monetary policy and bond buying programme to support the economy, generate employment and achieve inflation of around 2%, Fed officials also discussed the rate hike and an eventual reduction, or tapering, of the central bank’s bond buying programme.",
    "is_fake": 0
  },
  {
    "date": "June 18, 2021 12:36:33 pm",
    "title": "Explained: What’s at stake as Iran votes to determine next president?",
    "text": "Among the four candidates, hardline judiciary chief Ebrahim Raisi appears to be the front-runner based on state-linked polling. Abdolnasser Hemmati, the former head of Iran’s Central Bank, appears to be representing moderates in the race. Also running are Mohsen Rezaei, a former Revolutionary Guard commander; and Amir Hossein Ghazizadeh, a current lawmaker. At the country’s three debates, it appeared to instead be a two-man race as candidates largely targeted Hemmati for criticism over being part of the administration of current President Hassan Rouhani until recently.Rouhani, whose government reached the 2015 nuclear deal with world powers, is term limited from seeking another four years in office.The Guardian Council, Iran’s constitutional watchdog that approves candidates, also barred a number of prominent candidates from running this year. They included Ali Larijani, a conservative former parliament speaker who in recent years found himself allied with Rouhani.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 19, 2021  12:50:17 pm",
    "title": "Explained: The challenges to the Affordable Care Act",
    "text": "The court has now dismissed the challenge to the healthcare act that was initiated by the state of Texas. Last year, amid the , the Trump administration had urged the Supreme Court to overturn this act.ACA or the Patient Protection and Affordable Care Act was enacted in 2010 and required most Americans to get a minimum health insurance coverage. It imposed a penalty on those who failed to get the essential minimum health coverage. However, some changes were made to this act in 2017 that nullified this penalty to $0. This change prompted Texas and some Republican-led states to file a suit against federal officials on the basis that without the penalty the minimum essential healthcare coverage would become unconstitutional rendering the act invalid.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 19, 2021  9:50:53 am",
    "title": "New research: Test using graphene shown to detect coronavirus in lab",
    "text": "In experiments, researchers combined sheets of graphene, which are more than 1,000 times thinner than a postage stamp, with an antibody designed to target the spike protein on the . They then measured the atomic-level vibrations of these graphene sheets when exposed to Covid-positive and Covid-negative samples in artificial saliva. These sheets were also tested in the presence of other coronaviruses, like MERS-CoV.The researchers found that the vibrations of the antibody-coupled graphene sheet changed when treated with a Covid-positive sample, but not when treated with a Covid-negative sample or with other coronaviruses.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 19, 2021  9:40:46 am",
    "title": "Explained: How poll results are challenged, and when courts have set them aside",
    "text": "  in the Calcutta High Court challenging the Assembly election result of Nandigram constituency, where she had contested and lost. She has sought that Suvendhu Adhikari’s election be declared void on grounds of corrupt practice and discrepancies in the counting procedure conducted by the Returning Officer.The Election Commission’s role ends with the declaration of results, that is once the Returning Officer has signed the final result sheet (Form 20). After that, an election petition is the only legal remedy available to a voter or a candidate who believes there has been malpractice in an election. Such a person can challenge the result through an election petition submitted to the High Court of the state in which the constituency is located. Such a petition has to be filed within 45 days from the date of the poll results; nothing is entertained by courts after that. Although the Representative of the People Act of 1951 suggests that the High Court should try to conclude the trial within six months, it usually drags on for much longer, even years.",
    "is_fake": 0
  },
  {
    "date": "June 19, 2021 12:45:03 pm",
    "title": "Explained: What is the Catholic Communion controversy?",
    "text": " that has stirred controversy among their colleagues before a word of it has even been written.The US Conference of Catholic Bishops overwhelmingly approved the drafting of a document “on the meaning of the Eucharist in the life of the Church” that some bishops hope will be a rebuke for politicians who support abortion rights but continue to receive Communion.The 168-55 vote to proceed, vehemently opposed by a minority of bishops amid impassioned debate during virtual meetings, came despite appeals from the Vatican for a more cautious and collegial approach.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 19, 2021  9:24:18 am",
    "title": "Explained: Of the 130 reservoirs, 49 have more water than they had stored in June 2020",
    "text": "As of June 17, the collective stock in the 130 reservoirs was 47.63 billion cubic metres (BCM), or 27% of the total live storage capacity of 174.23 BCM. In June last year, they had stocked 55.11 BCM.Of the 130 reservoirs, 49 have more water than they had stored in June 2020. A majority of these reservoirs are located in seven states — Jharkhand, Tripura, Andhra Pradesh, Telangana, Kerala, Karnataka and Tamil Nadu.Of the reservoirs with less storage than in June 2020, many are in the larger states of Maharashtra, Uttar Pradesh, Madhya Pradesh and Odisha, besides Punjab, Himachal Pradesh, Chhattisgarh and Uttarakhand. This year, two large dams — Hariharjhore in Odisha and Ujjani in Maharashtra — have reached dead stock. This time last year, Hariharjhore had stocked 59% of its capacity.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:41:45 am",
    "title": "Centrum takeover of PMC Bank: What’s in store for existing depositors",
    "text": " with its partner BharatPe, digital payment firm.As of now, PMC depositors are keenly awaiting details of the scheme and finally hoping to get their money back.While the RBI has paved the way for a joint venture of Centrum and BharatPe to take over the troubled PMC Bank, the central bank has not come out with the details of the proposed acquisition of PMC Bank. If past cases of bank mergers are anything to go by, eventually PMC Bank depositors are likely to get back the money stuck as fixed deposits.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  9:10:17 am",
    "title": "Explained: Who is Ebrahim Raisi, the hard-line cleric set to be Iran’s next president?",
    "text": " after a partial counting of the votes revealed a significant lead for him after Saturday’s presidential elections.Raisi first came to prominence when he became the Prosecutor General of Karaj in 1980, when he was 20 years old. Subsequently, he became the Prosecutor of Tehran and the First Deputy to the Head of Judiciary from 2004 to 2014 after which he became the Prosecutor General of Iran from 2014 to 2016.In 2019, Raisi was appointed the head of Iran’s judiciary, an appointment that sparked concerns because of his involvement in the mass executions of thousands of political prisoners in 1988 after the Iran-Iraq war.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  9:10:11 am",
    "title": "Explained: An oversight that left key provision of the NDPS Act inoperable",
    "text": "The NDPS Act, 1985 is the principal legislation through which the state regulates the operations of narcotic drugs and psychotropic substances.It provides a stringent framework for punishing offences related illicit traffic in narcotic drugs and psychotropic substances through imprisonments and forfeiture of property.Section 27A of the NDPS Act, 1985, prescribes the punishment for financing illicit traffic and harbouring offenders.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 30, 2021  8:38:39 am",
    "title": "Explained: Here are the Covid-19 requirements for Indians flying to Dubai",
    "text": " cases in India during the second wave of the .The Dubai government has relaxed restrictions for travel from India, Nigeria and South Africa with effect from June 23. With regard to travel from India, only passengers with a valid residence visa who have received two doses of a UAE-approved vaccine, are allowed to travel to Dubai. There are four vaccines approved by the UAE government — Sinopharm, Pfizer-BioNTech, Sputnik V and Oxford-AstraZeneca.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 16, 2021  8:08:14 am",
    "title": "Explained: What are the race-related lawsuits against Harvard and Yale?",
    "text": "In February 2020, the department had asked a federal appeals court to overturn a 2019 case ruling that found that Harvard does not discriminate against Asian-American applicants. In November last year, the federal appeals court in Boston ruled that the usage of race by Harvard University was limited and in line with precedents set by the Supreme Court.Harvard has been challenged by Students for Fair Admissions, a non-profit membership group with over 20,000 members who believe that racial classifications and preferences in college admissions are “unfair, unnecessary, and unconstitutional”.“A student’s race and ethnicity should not be factors that either harm or help that student to gain admission to a competitive university,” the group’s website mentions. It has filed lawsuits against Harvard University, the University of North Carolina and the University of Texas.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 16, 2021  8:07:20 am",
    "title": "Explained: A Tamil family and their fight to stay in Australia",
    "text": "The Murugappans, Priya and Nades, along with their daughters Kopica (6) and Tharnicaa (4) who were born in Australia, were taken to the detention centre on Christmas Island in the Indian Ocean in 2018, after their asylum claims were rejected and their legal appeals were under consideration in courts.While there have been sustained calls for the release of the family from the detention centre, the family was in the headlines again last week after Tharnicaa developed sepsis and pneumonia and was airlifted to a hospital in Perth along with her mother. After over a week of separation, Immigration Minister Alex Hawke allowed the father and sibling to join the others in the city, where they will stay in a “community detention” government housing.The younger daughter’s worsening health has initiated an outpour of sympathy from supporters and politicians for the family, popularly known as the ‘Family of Biloela’ (a Queensland town where they lived). The family’s detention and possible deportation have sparked protests across the country, with a campaign ‘Home to Bilo’ at its forefront.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  12:02:16 pm",
    "title": "Explained: How Ram Vilas Paswan’s LJP slipped away from his son Chirag Paswan",
    "text": ", and have elected Chirag’s uncle,  MP Pashupati Kumar Paras, the LJP’s leader in Lok Sabha.The ‘new’ LJP has announced its intention to return to the NDA in Bihar, reversing Chirag’s decision to walk away from the alliance ahead of the Assembly elections in the state last year.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 16, 2021  7:44:01 am",
    "title": "Study shows inflammation in brain caused by Covid-19",
    "text": " patients involving different immune cells around the vascular system and in the brain tissue.The team, led by Professors Dr Marco Prinz and Dr Bertram Bengsch, has published its results in Immunity.“Even though there was already evidence of central nervous system involvement in Covid-19, the extent of inflammation in the brain surprised us,” lead author Henrike Salié is quoted as saying on the Freiburg University website.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 16, 2021  7:54:31 am",
    "title": "Explained: Why BSP is unravelling, and what it may mean in 2022 Uttar Pradesh polls",
    "text": " (BSP). A group of rebel BSP MLAs met  chief Akhilesh Yadav and claimed that they would soon announce their own party.Formed in 1984 by Kanshi Ram, the BSP has faced many splits over the years, each coinciding with a shift of power in the state, and marked by breakaway leaders accusing the leadership of arrogance and lack of connect, and going on to support those in power (either ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 27, 2021  8:32:06 am",
    "title": "AstraZeneca vaccine vs Delta variant of Covid-19: Two doses found crucial",
    "text": ", a major contributor to the second wave of  in India, and which has replaced the Alpha variant as the dominant strain in the UK.A new scientific analysis, published by Public Health ",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:56:00 am",
    "title": "Explained: Why is the southwest monsoon early?",
    "text": "On Tuesday, the northern limit of the monsoon (NLM) continued to pass through Diu, Surat, Nandurbar, Bhopal, Nagaon, Hamirpur, Barabanki, Bareilly, Saharanpur, Ambala, and Amritsar, according to the India Meteorological Department’s daily weather report.Across some areas of south peninsular and central India, the monsoon has arrived 7 to 10 days ahead of its scheduled date. So far, the monsoon has missed Northwest India — Gujarat, Rajasthan, western Madhya Pradesh, Haryana, Punjab and Delhi.As of Tuesday, the entire country except West Bengal and the Northeast, Jammu and Kashmir and Ladakh, Kerala, and Gujarat had received cumulative rainfall (since the official beginning of the southwest monsoon season on June 1) in excess (20%-59%) or large excess (60% or more) of normal.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 16, 2021  7:14:33 am",
    "title": "Delhi HC calls out misuse of UAPA, raises bar for State to slap terror tag",
    "text": " Tuesday to three student-activists Devangana Kalita, Natasha Narwal, and Asif Iqbal Tanha, mark a crucial moment.Quoting sections of the Unlawful Activities Prevention Act, 1967, and a string of key Supreme Court rulings on terrorism and terror laws, the court reasoned that “the more stringent a penal provision, the more strictly it must be construed”. By doing so, it raised the bar for the State to book an individual for terrorism under the UAPA.The three orders by Justices Siddharth Mridul and Anup Jairam Bhambhani are perhaps the first instance of a court calling out alleged misuse of the UAPA against individuals in cases that do not necessarily fall in the category of “terrorism” cases.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:59:18 am",
    "title": "Explained: The glitches on the new Income Tax e-filing portal",
    "text": ", the vendors for the new I-T portal on June 22. The meeting comes days after Finance Minister  had flagged the glitches on Twitter by tagging Infosys and Infosys Chairman Nandan Nilekani.The tax department in a statement on Tuesday night said that the meeting will discuss “issues/glitches in the recently launched e-filing portal of the Income Tax Department”. Other stakeholders including members from ICAI, auditors, consultants and taxpayers will also be a part of the interaction.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 17, 2021  7:14:54 am",
    "title": "Explained: What is hallmarking of gold, and for whom is it now mandatory?",
    "text": "The Bureau of Indian Standard (BIS), which operates gold and silver hallmarking scheme in India, defines hallmarking as the “accurate determination and official recording of the proportionate content of precious metal in precious metal articles.” So, it is a “guarantee of purity or fineness” of precious metal articles.The government, through a notification issued on June 14, 2018, notified two categories—gold jewellery and gold artefacts; and silver jewellery and silver artefacts—under the purview of hallmarking. So, hallmarking in India is available for jewellery of only two metals—gold and silver.However, a certain category of jewellery and items will be exempted from the mandatory requirement of hallmarking.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 24, 2021  9:10:55 am",
    "title": "Explained: The controversy over Marko Arnautovic’s Euro 2020 goal celebration",
    "text": "But Arnautovic’s goal celebration was wild. Much of his aggression appeared to have been directed at one of the Macedonian players. Serbian media reported that he allegedly used racist language in his outburst. He also flashed the ‘OK’ hand gesture, an innocuous symbol that was till recently used to indicate that all is well, but has now become a hate symbol appropriated by white supremacists.Facing pressure from the Football Federation of Macedonia (FFM), the governing body of football in Europe, UEFA, has now appointed an ethics and disciplinary inspector to probe the incident.While Arnautovic has apologised on Instagram for the “heated words” and underlined “I am not a racist”, the FFM’s statement calling for strong action against him hinted that he targeted Macedonian winger Ezgjan Alioski for his Albanian roots.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:56:35 am",
    "title": "Explained: What the loss of safe harbour means for Twitter",
    "text": " from the Ministry of Electronics and Information Technology (MeitY) for failing to adhere to norms while appointing executives in the roles of Resident Grievance Officer, Nodal Officer and Chief Compliance Officer.This, according to the government, means that the protection under Section 79 of the Information Technology (IT) Act, accorded to Twitter for being a social media intermediary, now stands withdrawn.Section 79 says that any intermediary shall not be held legally or otherwise liable for any third party information, data, or communication link made available or hosted on its platform.",
    "is_fake": 0
  },
  {
    "date": "June 16, 2021 6:31:38 pm",
    "title": "Biden-Putin summit: Who might walk free if they agree a prisoner swap?",
    "text": "Here are some of the individuals who could be freed if such a swap was agreed.Washington has demanded the release of Paul Whelan, a former U.S. Marine convicted of espionage last June and sentenced to 16 years in jail. Whelan has denied spying and says he was set up in a sting operation.Moscow said that Whelan, who holds US, British, Canadian and Irish passports, had been caught red-handed with classified information in a Moscow hotel room where agents from the Federal Security Service detained him on Dec. 28, 2018.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  11:01:57 am",
    "title": "Explained: Why SAD is counting on its alliance with BSP for a comeback",
    "text": " can help it stage in comeback in the state polls next years.  explains why the Akali Dal is pinning its hopes on this new alliance after its break up with the .",
    "is_fake": 0
  },
  {
    "date": "Updated: June 17, 2021  9:30:52 am",
    "title": "Explained: Why India and Pakistan are battling over basmati",
    "text": "In India, historically, the long-grained, aromatic rice has been cultivated in Indo-Gangetic plains at the foothills of the Himalayas. In modern India, this region is spread over Himachal Pradesh, Punjab, Haryana, Uttarakhand, Uttar Pradesh, Delhi and Jammu and Kashmir. Basmati has also been grown for centuries in the Kalar tract, which lies between the Ravi and Chenab rivers in Pakistan’s Punjab province.Given the high premium that basmati, an export-oriented product, fetches in the international market, there have been frequent disputes over granting the protected status to rice that may have been bred from basmati varieties and has the same qualities, but isn’t grown in the historical basmati-growing belt. In India, for example, the Madhya Pradesh government has been lobbying the central government for its basmati rice varieties to be granted the GI status, even taking the matter to the Supreme Court. The All India Rice Exporters’ Association (AIREA) is opposed to this, on the basis that it compromises basmati’s integrity.The Agricultural and Processed Food Products Export Development Authority (APEDA) itself had stated that GI status is strongly linked to a particular geographical region and, based on this, AIREA has argued that granting MP’s request would open the door to other regions within India as well as rival rice exporters like China and Pakistan to grow basmati varieties anywhere in their territories, thus diluting the power of the basmati brand.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 17, 2021  9:35:19 am",
    "title": "Explained: Why do some people get side effects after taking Covid-19 vaccines?",
    "text": "“The day after getting these vaccines, I wouldn’t plan anything that was strenuous physical activity,” said Dr. Peter Marks, the US Food and Drug Administration’s vaccine chief, who experienced fatigue after his first dose.The immune system has two main arms, and the first kicks in as soon as the body detects a foreign intruder. White blood cells swarm to the site, prompting inflammation that’s responsible for chills, soreness, fatigue and other side effects.This rapid-response step of your immune system tends to wane with age, one reason younger people report side effects more often than older adults. Also, some vaccines simply elicit more reactions than others.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  11:07:34 am",
    "title": "Explained: Who is Mohamedou Ould Slahi, the Mauritanian?",
    "text": ", starring Tahar Rahim, Jodie Foster and Benedict Cumberbatch, has brought to screen the life and ordeals of Mohamedou Ould Slahi, an electrical engineer-turned-Mujahideen fighter from Mauritania in western Africa, who spent 14 years in US custody at the Guantánamo Bay detention camp without ever being charged for a crime.Slahi, now 50, was arrested in Mauritania three months after the 9/11 attacks, and detained in Jordan and Afghanistan before being transferred to Guantánamo in August 2002, where his long incarceration included 70 days of intensive torture and three years of 18-hours-a-day interrogations.In 2005, while still in prison, Slahi wrote a memoir that was published in 2015 as ‘Guantánamo Diary’ –– which went on to become an international bestseller and later inspired the 2021 film. Slahi was finally released by the US in 2016, and now lives in his native Mauritania.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 17, 2021  9:31:29 am",
    "title": "The crisis in Punjab Congress: how rebellion brewed, what’s being done",
    "text": "Randhawa buried the hatched with party leader Navjot Singh Sidhu, giving an indication that they may get together against the CM. Sidhu has already been vocal against the CM, accusing him of quid pro quo with the Akalis. A few MLAs and ministers also sided with the rebel camp. This prompted the AICC chief  to constitute a committee led by Leader of Opposition in Rajya Sabha Mallikarjun Kharge.The committee, after listening to about 150 leaders including ministers, MLAs, MPs, leaders of frontal organisations and others, submitted a report to the AICC chief. It heard Amarinder also, who according to committee member JP Aggarwal explained all the points raised by the partymen. The committee has recommended that Navjot Sidhu should be given a role and the party structure should be reorganised. The AICC is yet to start any action on the report.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  10:37:52 am",
    "title": "Explained: Who’s who in Israel’s new patchwork coalition government",
    "text": "The coalition spans the far-left to the far-right and includes for the first time a small Islamist faction representing Israel’s Arab minority.It is expected to focus mostly on economic and social issues rather than risk exposing internal rifts by trying to address major diplomatic issues such as the Israeli-Palestinian conflict.Here are the people who will be leading the new government:",
    "is_fake": 0
  },
  {
    "date": "Updated: June 18, 2021  8:46:26 am",
    "title": "Explained: Why Djokovic, and not Federer or Nadal, is the Greatest of All Time",
    "text": " 6-7(6), 2-6, 6-3, 6-2, 6-4 on Sunday. The Serb is now the only male player to have won each of the four Grand Slams at least twice. The question then arises, is Djokovic the Greatest of All Time? Yes, and he has been for some time, according to the numbers.Djokovic leads both Roger Federer (27-23) and Rafael Nadal (30-28 after the semifinal win on Friday) in head-to-head records. He is the only player to have wins over Federer and Nadal at all four Grand Slams. He’s also the only one to beat both in multiple Grand Slam finals, multiple Masters finals and in the final of the season-ending Championship.The three heavyweights have decidedly favourite kingdoms, with Djokovic holding the record of most Australian Open wins (9) and most hardcourt Majors and Masters titles overall. But success against his closest rivals on their preferred surfaces sets Djokovic apart.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:59:59 am",
    "title": "Explained: Who is Naftali Bennett, Israel’s new Prime Minister?",
    "text": " on power as the Knesset approved Naftali Bennett as Israel’s new Prime Minister late on Sunday evening India time.Netanyahu, Israel’s longest serving Prime Minister, is on trial for fraud, and he fell short of obtaining majority support after the general election in March this year — the country’s fourth inconclusive vote in two years.The new Prime Minister is a former aide to Netanyahu and is considered to the right of the outgoing leader. The centrist Yair Lapid, 57, will replace Bennett as PM after two years, if their fragile government survives till then.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  10:24:04 am",
    "title": "Explained: How PASIPHAE will peep into the unknown regions of the sky",
    "text": "Polar-Areas Stellar-Imaging in Polarisation High-Accuracy Experiment (PASIPHAE) is an international collaborative sky surveying project. Scientists aim to study the polarisation in the light coming from millions of stars.The name is inspired from Pasiphae, the daughter of Greek Sun God Helios, who was married to King Minos.The survey will use two high-tech optical polarimeters to observe the northern and southern skies, simultaneously.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  10:13:47 am",
    "title": "Explained: How Covid-19 affects human kidney cells",
    "text": " on kidney health. The findings appear in the Journal of the American Society of Nephrology (JASN).Many individuals who develop Covid-19 also experience kidney damage, but it has been so far unclear if this is a direct result of viral infection or a consequence of another condition or the body’s response to the infection. To investigate, a team led by Benjamin Dekel (Sheba Medical Center, Israel) cultivated human kidney cells in lab dishes and infected them with SARS-CoV-2. They found thatPrior to infection, the cells contained high levels of interferon signalling molecules, and the infection stimulated an inflammatory response that increased these molecules. In contrast, infection of kidney cells deficient in such molecules resulted in cell death, suggesting a protective effect. The cells in these experiments were grown as a three-dimensional spheroid that imitates the healthy kidney or as a two-dimensional layer that mimics the cells of an acutely injured kidney. Cells that mimicked an acutely injured kidney were more prone to infection and additional injury but not cell death.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 17, 2021  9:38:00 am",
    "title": "Explained: In Covid-19 pandemic, here are four food records",
    "text": " , when “food” – more specifically, rice and wheat channelled through the public distribution system (PDS) – has become the NDA government’s preeminent social safety net programme.Until 2019-20, offtake of grain from the Food Corporation of India’s (FCI) godowns averaged hardly 62 million tonnes (mt) per year, while even falling from almost 66 mt to just over 60 mt between 2012-13 and 2017-18. Much of it comprised PDS rations under the National Food Security Act (NFSA) of 2013. This law, passed during the previous UPA regime, entitles 81.35 crore Indians to receive at least 5 kg of wheat or rice per month at Rs 2 and Rs 3 per kg, respectively. The annual foodgrain allocation under NFSA – which includes a higher 35-kg monthly ration for 2.37 crore “poorest of the poor” households under the Antyodaya Anna Yojana – works out to nearly 55 mt.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  10:11:07 am",
    "title": "Tigray crisis: A new ‘famine’ in Ethiopia",
    "text": "In November, local government officials in Tigray had told Reuters that some 2.2 million people had been displaced by the fighting and many forced to flee to neighbouring countries. Although Ethiopia’s federal National Disaster Risk Management Commission disputed the number of displaced people, independent observers had agreed that it was exceptionally high.Reports have emerged of sexual violence against girls and women in the region. In April, the UN said investigations by news organisations and independent observers had revealed that sexual violence was being used as a “weapon of war”.This week, UN emergency relief coordinator Mark Lowcock said Tigray was now also witnessing widespread famine. The term ‘famine’ was used after the release on Thursday of an Integrated Food Security Phase Classification (IPC) analysis update, which uses a standardised scale originally developed by the UN, integrating “food security, nutrition, and livelihood information into a statement about the nature and severity of a crisis”.",
    "is_fake": 0
  },
  {
    "date": "June 10, 2021 7:52:58 am",
    "title": "New research: Covid-19 vaccines safe in bowel disease patients",
    "text": " vaccines, according to a recent study published in the American Journal of Gastroenterology. In fact, the study suggests, those being treated with advanced immune-modifying therapies may experience side effects less often than the general population.IBDs are chronic conditions that occur when the intestinal immune system becomes overreactive, causing chronic diarrhoea and other digestive symptoms.Researchers from Cedars-Sinai Medical Center, US, evaluated post-vaccination side effects in 246 adult IBD patients in a nationwide Covid-19 vaccine registry maintained at Cedars-Sinai. These patients, like those in the general population, most often reported pain and swelling at the injection site after vaccination, followed by fatigue, headache and dizziness, fever and chills, and gastrointestinal symptoms. Most side effects were mild and lasted only a few days.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 21, 2021  11:58:58 am",
    "title": "ExplainSpeaking: In defence of GDP as a measure of economic growth",
    "text": "Ever since India revised the way it calculates its Gross Domestic Product in 2015, there’s been a debate raging not just about how India calculates its GDP but also about GDP as a measure itself.Before tackling either of these questions, it would help to recollect how GDP is defined.The International Monetary Fund states “GDP measures the monetary value of final goods and services—that is, those that are bought by the final user—produced in a country in a given period of time (say a quarter or a year)”.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  12:03:59 pm",
    "title": "Explained: The fragile bond between Indian sports and Chinese brand",
    "text": "This wasn’t the first instance of an Indian sports body suspending its association with a Chinese brand. Last year, the BCCI parted ways with Vivo, IPL’s title sponsor. This came in the wake of the military skirmish on the India-China border and the banning of close to 100 Chinese apps by the Indian government. However, Vivo returned as IPL sponsor this year.On June 3, to mark the 50-day Olympics countdown, the IOA unveiled the kits Indian players would wear at the Games. After the ceremony, the IOA said in a media release: “Li Ning designed the official sports kit inspired by India’s national colours and integrated unique graphics to emote the energy and pride of the Indian Olympic Team.” The deal was reported to be worth approximately Rs 5 crore. The company was to supply sports attire, travelling and playing kits including bags for the athletes headed to Tokyo. The uniforms were unveiled by sports minister Kiren Rijiju, a Member of Parliament from Arunachal Pradesh, who was the chief guest for the ceremony.No. In fact, Li Ning was the Indian team’s apparel sponsor even at the Rio Olympics five years ago. The company also provided uniforms for the 2018 Commonwealth and Asian Games.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 14, 2021  11:58:58 am",
    "title": "Explained: Nigerian govt joins Koo; what this means for Twitter’s India-made rival",
    "text": ". Shortly after the ban, Koo had announced that it was available in Nigeria and was working to add local languages on its platform.Nigeria’s decision  in the country reportedly came as a result of the US-based social networking platform deleting a tweet by President Muhammadu Buhari for violating rules. The Nigerian government had alleged that the microblogging site was being used to undermine “Nigeria’s corporate existence” through the spreading of fake news that has “violent consequences”.",
    "is_fake": 0
  },
  {
    "date": "June 10, 2021 10:34:02 am",
    "title": "India Covid-19 numbers explained: Why the death toll jumped all of a sudden",
    "text": " on Wednesday saw India reporting the highest number of coronavirus-related deaths on any day since the beginning of the  last year.A total of 6,148 deaths were reported on Wednesday, but only because Bihar added 3,951 deaths that were previously not accounted for. It wasn’t clear in what time period these deaths had happened in Bihar, but this is the first time that the state has carried out a data cleaning exercise. So, it is possible that some of the deaths included on Wednesday are from last year as well. States like Maharashtra do a similar exercise fairly regularly, at the end of every month. Even in their daily counts, a large number of deaths are from previous two to three weeks.",
    "is_fake": 0
  },
  {
    "date": "Updated: June 11, 2021  7:39:00 am",
    "title": "Explained: Delhi’s Master Plan 2041, its key areas and challenges",
    "text": "A master plan of any city is like a vision document by the planners and the land-owning agency of the city, which gives a direction to the future development. It includes analysis, recommendations, and proposals keeping in mind the population, economy, housing, transportation, community facilities, and land use. The current master plan of Delhi — Master Plan 2021 — expires this year.The draft of the Master Plan for Delhi 2041 comprises two volumes and 22 chapters, which seeks to “foster a sustainable, liveable and vibrant Delhi by 2041”. The first volume is an introduction, providing an overview of Delhi in present times, its global and regional positioning, estimates of population, and projections for 2041. The draft MPD presents a plan for the city for the next 20 years.In the housing sector, it talks about incentivising rented accommodation by inviting private players and government agencies to invest more, keeping in mind the large migrant population. It addresses parking problems and suggests a ‘user pays’ principle, which means users of all personal motor vehicles, except for non-motorised ones, have to pay for authorised parking facilities, spaces and streets.",
    "is_fake": 0
  },
  {
    "date": "June 10, 2021 1:19:58 pm",
    "title": "Explained: Just how vulnerable is the internet?",
    "text": " on Tuesday, disrupting business and leisure for untold millions globally. The problem was quickly resolved. The company, Fastly, blamed a configuration error in its technology.But the incident — Fastly’s traffic dropped 75% for about an hour just as the US East Coast was beginning to stir — raises questions about how vulnerable the global internet is to more serious disruption.San Francisco-based Fastly isn’t a household name, but its “edge server” computing technology is used by many of the world’s most popular websites, such as The New York Times, Shopify, the Guardian, Ticketmaster, Pinterest, Etsy, Wayfair and Stripe. The British government is among its clients.",
    "is_fake": 0
  }
]